{
  "backend/main.mo": "Empty Motoko actor placeholder for backend logic.",
  "feature_evidence.json": "Aggregates feature implementation details, associated files, components, and confidence metadata for build tracking.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference or build tooling.",
  "frontend/index.css": "Defines global Tailwind-based styles and theme variables, including light/dark color schemes and base styling.",
  "frontend/index.html": "HTML entry point setting up fonts, metadata, and root element for the React Valentine app.",
  "frontend/src/App.tsx": "Renders the ValentineFlow component as the main application view.",
  "frontend/src/components/valentine/assets.ts": "Exports paths for static assets like the couple hero image and hearts pattern.",
  "frontend/src/components/valentine/content.ts": "Provides shayari text, song metadata, quotes, and date ideas used across Valentine steps.",
  "frontend/src/components/valentine/hooks/useEvasiveButton.ts": "Implements logic for an evasive button that moves when the user approaches via pointer or touch.",
  "frontend/src/components/valentine/hooks/useSingleAudioPlayer.ts": "Ensures only one audio track plays at a time with play/pause management and error handling.",
  "frontend/src/components/valentine/steps/DateIdeasStep.tsx": "Displays a scrollable list of virtual date ideas with icons and a back button in a styled card layout.",
  "frontend/src/components/valentine/steps/GoodChoiceStep.tsx": "Displays a congratulatory screen with a heart animation, an image, and a continue button.",
  "frontend/src/components/valentine/steps/MusicStep.tsx": "Shows a playlist of songs with play/pause controls using a single-audio hook and navigation buttons.",
  "frontend/src/components/valentine/steps/ProposalStep.tsx": "Renders a Valentine proposal with an evasive 'No' button and a fixed 'Yes' button.",
  "frontend/src/components/valentine/steps/QuotesStep.tsx": "Lists romantic quotes in styled cards with back and continue navigation.",
  "frontend/src/components/valentine/steps/ShayariStep.tsx": "Displays a block of shayari text with back and continue buttons.",
  "frontend/src/components/valentine/ValentineFlow.tsx": "Controls the multi-step Valentine experience with state-driven navigation across proposal, content, and finale steps.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, logout, and identity state management using AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables for themes, global fonts, and custom animations/utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements for a multi-step romantic Valentine web experience with proposal, images, shayari, songs, quotes, and date ideas."
}