{
  "kind": "build_request",
  "title": "Fix broken production link and republish with a new working share URL",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Investigate and fix why the current production URL does not load in any browser, ensuring the deployed frontend is a proper production build (not a development entry that depends on /src/* at runtime) and that the app renders successfully at the root icp0.io domain.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Your idea was good but this link not work on any browser please solve this problem and generate new link for me"
        ]
      },
      "acceptanceCriteria": [
        "Opening the production URL in Chrome, Firefox, and mobile Chrome loads the Valentine flow and shows the first (proposal) step without a blank screen or console errors caused by missing /src/* resources.",
        "All required JS/CSS/assets are served successfully (no 404s for entry scripts/styles) when loading the production URL.",
        "Static assets referenced by the app (e.g., /assets/generated/*) load successfully in production (no broken images/backgrounds)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Remove the runtime dependency on external Google Fonts by bundling required fonts locally (or switching to a fully local/system font stack) so the page can render correctly even when external font CDNs are blocked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "this link not work on any browser"
        ]
      },
      "acceptanceCriteria": [
        "The deployed app loads and remains readable/styled even when the browser blocks requests to https://fonts.googleapis.com and https://fonts.gstatic.com.",
        "No external font stylesheet links remain in the production HTML output."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Republish the application to production after the fix and provide a new, working icp0.io share link.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please solve this problem and generate new link for me"
        ]
      },
      "acceptanceCriteria": [
        "A new production deployment is created.",
        "A new working share URL (icp0.io) is produced and verified to load the app."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add an in-app “Share” section (or button) that displays the current app URL and provides a one-tap “Copy link” action, so the user can reliably share the correct link from any device.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "generate new link for me"
        ]
      },
      "acceptanceCriteria": [
        "The app displays the current URL (derived from window.location) in a share UI.",
        "Tapping “Copy link” copies the URL to the clipboard and provides a clear success state (English text).",
        "The share UI does not require any external network services (e.g., no third-party QR endpoints)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not modify immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if state migration is truly required."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is allowed).",
    "Adding real-time features (WebSockets/chat/push notifications).",
    "Rebuilding the Valentine flow content/steps unless required to fix loading issues."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}